src/xml/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hs="http://www.holidaywebservice.com/HolidayService_v2/">
	<soapenv:Body>
		<hs:GetHolidaysAvailable>
			<hs:countryCode>UnitedStates</hs:countryCode>
		</hs:GetHolidaysAvailable>
	</soapenv:Body>
</soapenv:Envelope>